{
    "definitions": {
        "2.2": {
            "description": "(Schema version 2.0 or later) Gather metadata about applications, files, and configurations on your managed instances. This plugin runs on Linux and Microsoft Windows Server operating systems.",
            "properties": {
                "inputs": {
                    "properties": {
                        "applications": {
                            "description": "(Optional) Collect metadata for installed applications.",
                            "type": "string"
                        },
                        "awsComponents": {
                            "description": "(Optional) Collect metadata for AWS components like amazon-ssm-agent.",
                            "type": "string"
                        },
                        "files": {
                            "description": "(Optional, requires SSM Agent version 2.2.64.0 or later) Collect metadata for files, including file names, the time files were created, the time files were last modified and accessed, and file sizes, to name a few.",
                            "type": "string"
                        },
                        "networkConfig": {
                            "description": "(Optional) Collect metadata for network configurations.",
                            "type": "string"
                        },
                        "windowsUpdates": {
                            "description": "(Optional) Collect metadata for all Windows updates.",
                            "type": "string"
                        },
                        "instanceDetailedInformation": {
                            "description": "(Optional) Collect more instance information than is provided by the default inventory plugin (aws:instanceInformation), including CPU model, speed, and the number of cores, to name a few.",
                            "type": "string"
                        },
                        "services": {
                            "description": "(Optional, Windows OS only, requires SSM Agent version 2.2.64.0 or later) Collect metadata for service configurations.",
                            "type": "string"
                        },
                        "windowsRegistry": {
                            "description": "(Optional, Windows OS only, requires SSM Agent version 2.2.64.0 or later) Collect Windows Registry keys and values. You can choose a key path and collect all keys and values recursively. You can also collect a specific registry key and its value for a specific path. Inventory collects the key path, name, type, and the value.",
                            "type": "string"
                        },
                        "windowsRoles": {
                            "description": "(Optional, Windows OS only, requires SSM Agent version 2.2.64.0 or later) Collect metadata for Microsoft Windows role configurations.",
                            "type": "string"
                        },
                        "customInventory": {
                            "description": "(Optional) Collect custom inventory data.",
                            "type": "string"
                        }
                    }
                }
            }
        }
    }
}
