{
    "definitions": {
        "2.2": {
            "description": "(Schema version 2.0 or later) Install or uninstall a Distributor package. You can install the latest version, default version, or a version of the package you specify. Packages provided by AWS are also supported. This plugin runs on Windows Server and Linux operating systems, but not all the available packages are supported on Linux operating systems.                                               Available AWS packages for Windows Server include the following: AWSPVDriver, AWSNVMe, AwsEnaNetworkDriver, AwsVssComponents, AmazonCloudWatchAgent, and AWSSupport-EC2Rescue. Available AWS packages for Linux operating systems include the following: AmazonCloudWatchAgent and AWSSupport-EC2Rescue.",
            "properties": {
                "inputs": {
                    "properties": {
                        "name": {
                            "description": "The name of the AWS package to install or uninstall. Available packages include the following: AWSPVDriver, AwsEnaNetworkDriver, AwsVssComponents, and AmazonCloudWatchAgent.",
                            "type": "string"
                        },
                        "action": {
                            "description": "Install or uninstall a package.",
                            "type": "string",
                            "anyOf": [
                                {
                                    "enum": ["Install", "Uninstall"]
                                },
                                {
                                    "pattern": "^{{[ ]{0,1}[a-zA-Z_.]+[ ]{0,1}}}$"
                                }
                            ]
                        },
                        "installationType": {
                            "description": "The type of installation to perform. If you specify Uninstall and reinstall, the package is completely uninstalled, and then reinstalled. The application is unavailable until the reinstallation completes. If you specify In-place update, only new or changed files are added to the existing installation according you instructions you provide in an update script. The application remains available throughout the update process. Uninstall and reinstall is the default value.",
                            "type": "string",
                            "anyOf": [
                                {
                                    "enum": ["Uninstall and reinstall", "In-place update"]
                                },
                                {
                                    "pattern": "^{{[ ]{0,1}[a-zA-Z_.]+[ ]{0,1}}}$"
                                }
                            ]
                        },
                        "version": {
                            "description": "A specific version of the package to install or uninstall. If installing, the system installs the latest published version, by default. If uninstalling, the system uninstalls the currently installed version, by default. If no installed version is found, the latest published version is downloaded, and the uninstall action is run.",
                            "type": "string"
                        }
                    },
                    "required": ["name", "action"]
                }
            },
            "required": ["inputs"]
        }
    }
}
